2017-05-01-Support-for-imenu-in-dired.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-09-22 Sat 13:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Support for imenu in dired</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matúš Goljer" />
<link rel="stylesheet" href="css/blog.css" />
</head>
<body>
<div id="preamble" class="status">

<div style="text-align: left; float: left;">
  <a href="./sitemap.html">Home</a>
  <a href="https://github.com/Fuco1/">GitHub</a>
  <a href="https://www.patreon.com/user?u=3282358">Patreon</a>
</div>
<div style="text-align: right;">
  <a href="https://fuco1.github.io/rss.xml">RSS</a>
  <a href="https://twitter.com/Fuco1337">Twitter</a>
</div>
<hr />
</div>
<div id="content">
<h1 class="title">Support for imenu in dired</h1>

<table id="org869e76f" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Date</th>
<th scope="col" class="org-left">Change</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2018-09-22</td>
<td class="org-left">Use <code>imenu--generic-function</code> as part of custom index-making functions to capture indices generated by external packages</td>
</tr>
</tbody>
</table>


<p>
<code>imenu</code> is a very simple package that builds index of <i>interesting</i>
positions in the current buffer and presents them as a menu.  You pick
the item and the point moves there.  There is a built-in interface and
also one in <a href="https://github.com/Fuco1/sallet">sallet</a>, <a href="https://github.com/emacs-helm/helm">helm</a> or <a href="https://github.com/abo-abo/swiper">counsel</a>.
</p>

<p>
Unfortunatelly <code>dired</code> doesn't come with support for it, so here I add
some definitions to generate the index of all the inserted
directories.
</p>

<p>
The most common way to add items to the index is by modifying
<code>imenu-generic-expression</code> which is a list of lists of the form
<code>(GROUP-NAME REGEX MATCH-GROUP)</code>.  Then imenu searches for the <code>REGEX</code> and
adds the corresponding <code>MATCH-GROUP</code> and its match position to the
index.  This is done by <code>imenu-default-create-index-function</code> which is
the default value of <code>imenu-create-index-function</code>.
</p>

<p>
Another more generic way is to write your own functions
<code>imenu-prev-index-position-function</code> and
<code>imenu-extract-index-name-function</code> which find the position and the name
of the item.  If both of these are set
<code>imenu-default-create-index-function</code> uses those instead of the regexp
list.
</p>

<p>
I have a hybrid approach here.  I use the regexp mechanism because
that is what most external packages use and I want to be able to
install those additions and use them seamlessly (for example
<a href="https://github.com/Fuco1/dired-hacks/pull/140">dired-hacks</a> and its filter groups).  But I also want to add some other
items to the index, so I set my own <code>imenu-create-index-function</code> and
add some more items "manually".
</p>

<p>
In particular, I like to add all the parents of the current directory
which can then be opened via <a href="https://github.com/Fuco1/dired-hacks/blob/master/dired-open.el">dired-open</a>'s <code>dired-open-subdir</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span><span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">my-dired-imenu-create-parents-index</span> <span style="color: #888a85;">()</span>
  <span style="color: #e9b96e;">"Create index of all parent positions of current dired."</span>
  <span style="color: #888a85;">(</span><span style="color: #b4fa70;">save-excursion</span>
    <span style="color: #888a85;">(</span>dired-prev-subdir 0<span style="color: #888a85;">)</span>
    <span style="color: #888a85;">(</span><span style="color: #b4fa70;">let</span> <span style="color: #888a85;">(</span>parents
          <span style="color: #888a85;">(</span>beg <span style="color: #888a85;">(</span><span style="color: #b4fa70;">save-excursion</span>
                 <span style="color: #888a85;">(</span>beginning-of-line<span style="color: #888a85;">)</span>
                 <span style="color: #888a85;">(</span>1- <span style="color: #888a85;">(</span>search-forward <span style="color: #e9b96e;">"/"</span><span style="color: #888a85;">)))))</span>
      <span style="color: #888a85;">(</span><span style="color: #b4fa70;">while</span> <span style="color: #888a85;">(</span>search-backward <span style="color: #e9b96e;">"/"</span> beg t<span style="color: #888a85;">)</span>
        <span style="color: #888a85;">(</span><span style="color: #b4fa70;">push</span>
         <span style="color: #888a85;">(</span>cons
          <span style="color: #888a85;">(</span>buffer-substring-no-properties beg <span style="color: #888a85;">(</span>point<span style="color: #888a85;">))</span>
          <span style="color: #888a85;">(</span>1- <span style="color: #888a85;">(</span>point<span style="color: #888a85;">)))</span>
         parents<span style="color: #888a85;">))</span>
      <span style="color: #888a85;">(</span>cons <span style="color: #e9b96e;">"Parents"</span> <span style="color: #888a85;">(</span>cdr parents<span style="color: #888a85;">)))))</span>

<span style="color: #888a85;">(</span><span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">my-dired-imenu-create-index</span> <span style="color: #888a85;">()</span>
  <span style="color: #e9b96e;">"Create `</span><span style="color: #e6a8df;">imenu</span><span style="color: #e9b96e;">' index for dired."</span>
  <span style="color: #888a85;">(</span><span style="color: #b4fa70;">let</span> <span style="color: #888a85;">(</span>subdirs-alist
        <span style="color: #888a85;">(</span>parents-alist <span style="color: #888a85;">(</span>my-dired-imenu-create-parents-index<span style="color: #888a85;">)))</span>
    <span style="color: #888a85;">(</span><span style="color: #b4fa70;">let*</span> <span style="color: #888a85;">((</span>imenu-generic-expression '<span style="color: #888a85;">((</span><span style="color: #e9b96e;">"Subdir"</span> <span style="color: #e9b96e;">"^  </span><span style="color: #e9b96e; font-weight: bold;">\\</span><span style="color: #e9b96e; font-weight: bold;">(</span><span style="color: #e9b96e;">.*?</span><span style="color: #e9b96e; font-weight: bold;">\\</span><span style="color: #e9b96e; font-weight: bold;">)</span><span style="color: #e9b96e;">:$"</span> 1<span style="color: #888a85;">)))</span>
           <span style="color: #888a85;">(</span>alist <span style="color: #888a85;">(</span>car <span style="color: #888a85;">(</span>imenu-default-create-index-function<span style="color: #888a85;">)))</span>
           <span style="color: #888a85;">(</span>uniquified <span style="color: #888a85;">(</span>f-uniquify-alist <span style="color: #888a85;">(</span><span style="color: #b4fa70;">-map</span> <span style="color: #e6a8df;">'car</span> <span style="color: #888a85;">(</span>cdr alist<span style="color: #888a85;">)))))</span>
      <span style="color: #888a85;">(</span><span style="color: #b4fa70;">setq</span> subdirs-alist
            <span style="color: #888a85;">(</span>cons
             <span style="color: #888a85;">(</span>car alist<span style="color: #888a85;">)</span>
             <span style="color: #888a85;">(</span><span style="color: #b4fa70;">--remove</span>
              <span style="color: #888a85;">(</span>= 0 <span style="color: #888a85;">(</span>length <span style="color: #888a85;">(</span>car <span style="color: #fcaf3e;">it</span><span style="color: #888a85;">)))</span>
              <span style="color: #888a85;">(</span><span style="color: #b4fa70;">--map</span> <span style="color: #888a85;">(</span>cons <span style="color: #888a85;">(</span>cdr <span style="color: #888a85;">(</span>assoc <span style="color: #888a85;">(</span>car <span style="color: #fcaf3e;">it</span><span style="color: #888a85;">)</span> uniquified<span style="color: #888a85;">))</span> <span style="color: #888a85;">(</span>cdr <span style="color: #fcaf3e;">it</span><span style="color: #888a85;">))</span>
                     <span style="color: #888a85;">(</span>cdr alist<span style="color: #888a85;">))))))</span>
    <span style="color: #888a85;">(</span><span style="color: #b4fa70;">let</span> <span style="color: #888a85;">((</span>alist <span style="color: #888a85;">(</span>imenu-default-create-index-function<span style="color: #888a85;">)))</span>
      <span style="color: #888a85;">(</span><span style="color: #b4fa70;">-cons*</span> subdirs-alist
              parents-alist
              alist<span style="color: #888a85;">))))</span>

<span style="color: #888a85;">(</span><span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">my-dired-imenu-init</span> <span style="color: #888a85;">()</span>
  <span style="color: #e9b96e;">"Initialize `</span><span style="color: #e6a8df;">imenu</span><span style="color: #e9b96e;">' variables in current buffer."</span>
  <span style="color: #888a85;">(</span><span style="color: #b4fa70;">setq-local</span> imenu-create-index-function
              <span style="color: #e6a8df;">'my-dired-imenu-create-index</span><span style="color: #888a85;">))</span>
</pre>
</div>

<p>
To use this just add <code>my-dired-imenu-init</code> to <code>dired-mode-hook</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #888a85;">(</span>add-hook <span style="color: #e6a8df;">'dired-mode-hook</span> <span style="color: #e6a8df;">'my-dired-imenu-init</span><span style="color: #888a85;">)</span>
</pre>
</div>

<p>
The code depends on <code>f</code> and <code>dash</code>.
</p>
</div>
<div id="postamble" class="status">
<hr />
<div style="text-align: left; float: left;">Last updated at: 2018-09-22 13:07</div>
<div style="text-align: right;">Found a typo? <a href="https://github.com/Fuco1/fuco1.github.io/blob/master/posts/2017-05-01-Support-for-imenu-in-dired.org">Edit on GitHub!</a></div>
</div>
</body>
</html>
